tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/aliases'
tap 'homebrew/apache'
tap 'homebrew/binary'
tap 'homebrew/bundle'
tap 'homebrew/completions'
tap 'homebrew/dev-tools'
tap 'homebrew/dupes'
tap 'homebrew/emacs'
tap 'homebrew/fuse'
tap 'homebrew/games'
tap 'homebrew/gui'
tap 'homebrew/nginx'
tap 'homebrew/php'
tap 'homebrew/python'
tap 'homebrew/science'
tap 'homebrew/services'
tap 'homebrew/versions'
tap 'homebrew/x11'
cask 'osxfuse'
cask 'xquartz'
brew 'ack'
brew 'autoconf'
brew 'xz'
brew 'automake'
brew 'readline'
brew 'bash'
brew 'bash-completion'
brew 'cmake'
brew 'coreutils'
brew 'openssl'
brew 'pkg-config'
brew 'libidn'
brew 'libressl'
brew 'curl'
brew 'pcre'
brew 'gettext'
brew 'git'
brew 'x264'
brew 'lame'
brew 'libvo-aacenc'
brew 'xvid'
brew 'libpng'
brew 'freetype'
brew 'ffmpeg'
brew 'findutils'
brew 'fpp'
brew 'gcal'
brew 'gdbm'
brew 'gnu-getopt'
brew 'git-flow-avh'
brew 'libffi'
brew 'glib'
brew 'goaccess'
brew 'libtool'
brew 'jpeg'
brew 'libtiff'
brew 'graphicsmagick'
brew 'htop-osx'
brew 'httpie'
brew 'hub'
brew 'icdiff'
brew 'icu4c'
brew 'imagemagick'
brew 'oniguruma'
brew 'jq'
brew 'libevent'
brew 'sqlite'
brew 'python'
brew 'libxml2'
brew 'libyaml'
brew 'lua'
brew 'luajit'
brew 'mackup'
brew 'protobuf'
brew 'mitmproxy'
brew 'mobile-shell'
brew 's-lang'
brew 'most'
brew 'mycli'
brew 'node'
brew 'opencc'
brew 'pdsh'
brew 'postgresql'
brew 'pgcli'
brew 'rename'
brew 'ruby'
brew 'the_silver_searcher'
brew 'tig'
brew 'tmux'
brew 'trash'
brew 'tree'
brew 'unar'
brew 'unixodbc'
brew 'vim', args: ['with-lua', 'with-luajit', 'with-mzscheme', 'with-tcl']
brew 'webkit2png'
brew 'wget', args: ['with-debug', 'with-iri', 'with-libressl', 'with-pcre']
brew 'youtube-dl'
brew 'z'
brew 'zopfli'
brew 'caskroom/cask/brew-cask'
brew 'homebrew/completions/brew-cask-completion'
brew 'homebrew/completions/pip-completion'
brew 'homebrew/completions/vagrant-completion'
brew 'homebrew/dupes/grep'
brew 'homebrew/dupes/screen'
brew 'homebrew/dupes/whois'
brew 'homebrew/fuse/sshfs'
brew 'homebrew/php/php55'
brew 'homebrew/php/composer'
cask '1password'
cask 'alfred'
cask 'anki'
cask 'appcleaner'
cask 'bartender'
cask 'bettertouchtool'
cask 'betterzipql'
cask 'brushviewql'
cask 'cakebrew'
cask 'cheatsheet'
cask 'clipmenu-alpha'
cask 'day-o'
cask 'dictunifier'
cask 'dropbox'
cask 'dterm'
cask 'evernote'
cask 'firefox'
cask 'flash'
cask 'font-fontawesome'
cask 'font-inconsolata-dz-for-powerline'
cask 'font-source-code-pro'
cask 'forklift'
cask 'gas-mask'
cask 'github-desktop'
cask 'google-chrome'
cask 'google-drive'
cask 'google-japanese-ime'
cask 'haroopad'
cask 'hockey'
cask 'imageoptim'
cask 'ios-console'
cask 'ios-saver'
cask 'ipaql'
cask 'iterm2-beta'
cask 'jadengeller-helium'
cask 'java'
cask 'keka'
cask 'key-codes'
cask 'kkbox'
cask 'libreoffice'
cask 'loading'
cask 'macdown'
cask 'mailbox'
cask 'manico'
cask 'mplayerx'
cask 'mpv'
cask 'near-lock'
cask 'noizio'
cask 'numi'
cask 'nvalt'
cask 'onyx'
cask 'opera'
cask 'popkey'
cask 'prefs-editor'
cask 'provisionql'
cask 'psequel'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlnetcdf'
cask 'qlplayground'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'qlvideo'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'sequel-pro'
cask 'sequential'
cask 'shiftit'
cask 'shiori'
cask 'skim'
cask 'skitch'
cask 'skype'
cask 'slack'
cask 'sourcetree'
cask 'sublime-text3'
cask 'techstoreclub-simple-comic'
cask 'the-unarchiver'
cask 'thunderbird'
cask 'transmission'
cask 'typora'
cask 'virtualbox'
cask 'vlc'
cask 'welly'
cask 'wireshark'
